In [178]:
import pandas as pd

_______________________________________________________________________________________________________________
_______________________________________________________________________________________________________________
                                                    ___________________________________________________________
Дополнительный проект
В папке subsid (shared/homeworks/python_ds_miniprojects/5_subsid) находятся файлы (tm_sales_1, tm_sales_2, ...)
с продажами продуктов через телемаркетинг. Каждый файл содержит, как минимум, 4 колонки (поля): FILIAL_ID,
    SUBS_ID, PROD_ID, ACT_DTTM.

Суть задачи в том, чтобы проверить подключения продуктов определенным пользователям,
соединив файлы о продажах с логами по подключениям в системе.

Особенности данных:

сотрудники телемаркетинга не всегда указывают полный id, если 'id' нет в начале SUBS_ID, то нужно его добавить
поля в файлах могут быть расположены абсолютно случайным образом, но названия полей статичны
продажа не засчитывается, если отключение (END_DTTM) произошло меньше чем через 5 минут после подключения (START_DTTM)
если в файле с продажами встречается строка без указанного SUBS_ID, она пропускается
Сохраните результат в csv файл с разделителем ;, содержащий корректные подключения.

Note: обратите внимание на то, как pandas переводит дату из строки, возможно вам понадобится параметр format
                                                     ___________________________________________________________
_______________________________________________________________________________________________________________
_______________________________________________________________________________________________________________

                                        ____________________________________
                                      Для проверки результатов введите SUBS_ID
                                    из полученного датасета в порядке возрастания, 
                                              через запятую с пробелом.
                                        ____________________________________

In [179]:
tm_sales_3 = pd.read_csv('/mnt/HC_Volume_18315164/home-jupyter/jupyter-p-dolgih/shared/homeworks/python_ds_miniprojects/5_subsid/subsid/tm_sales_3.csv', sep=';')
tm_sales_2 = pd.read_csv('/mnt/HC_Volume_18315164/home-jupyter/jupyter-p-dolgih/shared/homeworks/python_ds_miniprojects/5_subsid/subsid/tm_sales_2.csv', sep=';')
tm_sales_1 = pd.read_csv('/mnt/HC_Volume_18315164/home-jupyter/jupyter-p-dolgih/shared/homeworks/python_ds_miniprojects/5_subsid/subsid/tm_sales_1.csv')
prod_activations_logs = pd.read_csv('/mnt/HC_Volume_18315164/home-jupyter/jupyter-p-dolgih/shared/homeworks/python_ds_miniprojects/5_subsid/subsid/prod_activations_logs.csv', sep=';')
# подгружаем нужные нам данные из папки

In [180]:
prod_activations_logs.head()

     SUBS_ID  PROD_ID        START_DTTM          END_DTTM
1  id4651830     1954  20-03-2020 14:59  01-12-2020 00:00
5  id7646509     6431  19-03-2020 13:00  19-03-2020 13:03
2  id7461794     3310  20-03-2020 17:25  01-12-2020 00:00
3  id5416547     1743  17-03-2020 10:17  25-03-2020 11:00
4  id8238421     1859  01-03-2020 11:42  01-03-2020 11:43

In [181]:
tm_sales_1.head()

  SUBS_ID;FILIAL_ID;PROD_ID;ACT_DTTM
0  id4651830;1;1954;20-03-2020 14:59
1    7646509;5;6431;19-03-2020 13:00
2  id7412683;4;3313;22-03-2020 17:25

In [182]:
tm_sales_2.head()

   FILIAL_ID    SUBS_ID  PROD_ID          ACT_DTTM
0          3  id5416547     1743  17-03-2020 10:17
1          4        NaN     7421  12-03-2020 11:25
2          7    8362218     9879  05-03-2020 11:42
3          2    2185490     3210  16-03-2020 16:28

In [183]:
tm_sales_3.head()

   FILIAL_ID  PROD_ID    SUBS_ID          ACT_DTTM
0          3     1499  id5764122  18-03-2020 15:44
1          6     3020  id7642700  15-03-2020 14:21
2          2     5677  id1374509  17-03-2020 11:48

In [184]:
# далее нам нужно склеить три датафрейма о продажах в один, сделаем это с помощью функции pd.concat
tm_sales = pd.concat([tm_sales_3, tm_sales_2, tm_sales_3], ignore_index=True)
# так же передадим в cocncat значение as_index=True, что бы пандас сам за нас переименовал строки
# в датафрейме

In [185]:
tm_sales.shape
# сначала узнаем какая длинна у нашего датафрейма с продажами на данный момент

(10, 4)

In [186]:
tm_sales = tm_sales.dropna(subset=['SUBS_ID'])
# возовем у tm_sales метод dropna, передав ему то, что пропуски необходимо
# дропать только по конкретному столбцу SUBS_ID
# если же в нём есть проппуски, то строки будут удалены
# если ж пропуски будут в каких-то других столбцах
# то это в свою очередь будет проигнорировано

In [187]:
tm_sales.shape
# после того, как мы дропнули наш столбец, мы можем увидеть,
# что у нас изменилось колличество строк в датафрейме

(9, 4)

In [188]:
tm_sales
# посмотрим, как выглядит наш датафрейм после изменений
# тут отсутствуют значения NaN и различные пропуски строк, всё стало выглядеть более 
# структурировано

   FILIAL_ID  PROD_ID    SUBS_ID          ACT_DTTM
0          3     1499  id5764122  18-03-2020 15:44
1          6     3020  id7642700  15-03-2020 14:21
2          2     5677  id1374509  17-03-2020 11:48
3          3     1743  id5416547  17-03-2020 10:17
5          7     9879    8362218  05-03-2020 11:42
6          2     3210    2185490  16-03-2020 16:28
7          3     1499  id5764122  18-03-2020 15:44
8          6     3020  id7642700  15-03-2020 14:21
9          2     5677  id1374509  17-03-2020 11:48

In [189]:
tm_sales.loc[~tm_sales.SUBS_ID.str.startswith('id'),
            'SUBS_ID']
# сотрудники телемаркетинга не всегда указывают полный id, если 'id' нет в начале SUBS_ID, то нужно его добавить
# но в данный момент, мы видим что у нас есть несколько строк, в которых отсутсвует ID в начале

5    8362218
6    2185490
Name: SUBS_ID, dtype: object

In [190]:
tm_sales.loc[~tm_sales.SUBS_ID.str.startswith('id'),
            'SUBS_ID'] = 'id' + tm_sales.loc[~tm_sales.SUBS_ID.str.startswith('id'), 'SUBS_ID']
# теперь пофиксим проблему выше, нам необходимо добавить отсутсвующее ID в строки SUBS_ID
# это можно сделать про помощи функции .loc так как он позволяет не только фильтровать данные
# но и способен обращаться по индексам строк датафрейма, имён столбцов и тд

# Тем самым верхнему срезу данных мы можем присвоить новое значение
# а новое значение нам необходимо сформимровать, для того что бы к этим значениям
# новое значение - мы просто сконкатернируем строки через +, переднюю часть + заднюю часть
# дописав туда каждый из id который в прошлой ячейке
# при этом мы меняем конкретный срез (1 формула в этой ячейке) и данные для конкатенации
# мы используем по тому же срезу, тоесть когда мы хотим присвоить что-то к какому-то 
# кусочку данных, оно должно иметь точно такой же размер
# мы не ходим присвоить нашей прошлой формуле неверные значения,
# по этому после знака + мы пишем что фильтруем данные по точно тому же условию 
# и снова обращаемся к той же колонке "SUBS_ID"
# в результате чего выполнив двнную ячейку, мы увидим что наши id
# присвоились всем значениям, которые раньше id не имели

In [191]:
tm_sales
# в результате чего выполнив двнную ячейку, мы увидим что наши id
# присвоились всем значениям, которые раньше id не имели

   FILIAL_ID  PROD_ID    SUBS_ID          ACT_DTTM
0          3     1499  id5764122  18-03-2020 15:44
1          6     3020  id7642700  15-03-2020 14:21
2          2     5677  id1374509  17-03-2020 11:48
3          3     1743  id5416547  17-03-2020 10:17
5          7     9879  id8362218  05-03-2020 11:42
6          2     3210  id2185490  16-03-2020 16:28
7          3     1499  id5764122  18-03-2020 15:44
8          6     3020  id7642700  15-03-2020 14:21
9          2     5677  id1374509  17-03-2020 11:48

In [192]:
sales_logs = prod_activations_logs.merge(tm_sales, on=['SUBS_ID', 'PROD_ID'])
# теперь мы можем сделать объединение наших датафреймов
# где мы объединим логи prod_activations_logs с данными о продажах tm_sales
# с помощью функции .merhe
# при том мы будем это объединять по колонкам что за юзер SUBS_ID
# и что за продукт PROD_ID
# дулаем мы здесь методом inner join который является по умолчанию у метода merge

In [193]:
sales_logs

,SUBS_ID,PROD_ID,START_DTTM,END_DTTM,FILIAL_ID,ACT_DTTM
0,id5416547,1743,17-03-2020 10:17,25-03-2020 11:00,3,17-03-2020 10:17
1,id2185490,3210,16-03-2020 16:28,01-12-2020 00:00,2,16-03-2020 16:28
2,id7642700,3020,15-03-2020 14:21,15-03-2020 23:42,6,15-03-2020 14:21
3,id7642700,3020,15-03-2020 14:21,15-03-2020 23:42,6,15-03-2020 14:21

In [194]:
sales_logs.dtypes
# посмотрим на типы данных, где мы увидим
# что столбцы, которые должны быть датами - на самом деле датами сейяас не являются

SUBS_ID       object
PROD_ID        int64
START_DTTM    object
END_DTTM      object
FILIAL_ID      int64
ACT_DTTM      object
dtype: object

In [195]:
pd.to_datetime(sales_logs.START_DTTM)
# форматируем наши данные в столбце и переведём их в date time

0   2020-03-17 10:17:00
1   2020-03-16 16:28:00
2   2020-03-15 14:21:00
3   2020-03-15 14:21:00
Name: START_DTTM, dtype: datetime64[ns]

In [196]:
sales_logs.START_DTTM = pd.to_datetime(sales_logs.START_DTTM)

In [197]:
pd.to_datetime(sales_logs.END_DTTM)

0   2020-03-25 11:00:00
1   2020-01-12 00:00:00
2   2020-03-15 23:42:00
3   2020-03-15 23:42:00
Name: END_DTTM, dtype: datetime64[ns]

In [198]:
sales_logs.END_DTTM = pd.to_datetime(sales_logs.END_DTTM, format='%d-%m-%Y %H:%M')
# здесь мы отформатируем дату по нашей колонке и датафрейму
# где в pd.to_datetime передадим датафрейм.колонку и вызовем формат
# куда укажем в каком формате хотим видеть дату, месяц, год, часы, минуты

In [202]:
sales_logs.dtypes
# посмотрим на результат изменения формата дат, как выглядят типы данных

SUBS_ID               object
PROD_ID                int64
START_DTTM    datetime64[ns]
END_DTTM      datetime64[ns]
FILIAL_ID              int64
ACT_DTTM              object
dtype: object

In [204]:
sales_logs
# посмотрим как выглядят изменения в датафрейме

,SUBS_ID,PROD_ID,START_DTTM,END_DTTM,FILIAL_ID,ACT_DTTM
0,id5416547,1743,2020-03-17 10:17:00,2020-03-25 11:00:00,3,17-03-2020 10:17
1,id2185490,3210,2020-03-16 16:28:00,2020-12-01 00:00:00,2,16-03-2020 16:28
2,id7642700,3020,2020-03-15 14:21:00,2020-03-15 23:42:00,6,15-03-2020 14:21
3,id7642700,3020,2020-03-15 14:21:00,2020-03-15 23:42:00,6,15-03-2020 14:21

In [211]:
sales_logs['difference'] = sales_logs.END_DTTM - sales_logs.START_DTTM
# здесь мы вычтем из end_dttm - start_dttm 
# что бы узнать какое время прошло между подключением и отключением услуги

In [212]:
sales_logs
# посмотрим что получилось - у нас добавился столбец difference

,SUBS_ID,PROD_ID,START_DTTM,END_DTTM,FILIAL_ID,ACT_DTTM,difference
0,id5416547,1743,2020-03-17 10:17:00,2020-03-25 11:00:00,3,17-03-2020 10:17,8 days 00:43:00
1,id2185490,3210,2020-03-16 16:28:00,2020-12-01 00:00:00,2,16-03-2020 16:28,259 days 07:32:00
2,id7642700,3020,2020-03-15 14:21:00,2020-03-15 23:42:00,6,15-03-2020 14:21,0 days 09:21:00
3,id7642700,3020,2020-03-15 14:21:00,2020-03-15 23:42:00,6,15-03-2020 14:21,0 days 09:21:00

In [214]:
sales_logs.dtypes
# когда мы вычитаем одно время из другого времени, у нас получается новый 
# тип объекта - это timedelta который является разницей во времени

SUBS_ID                object
PROD_ID                 int64
START_DTTM     datetime64[ns]
END_DTTM       datetime64[ns]
FILIAL_ID               int64
ACT_DTTM               object
difference    timedelta64[ns]
dtype: object

In [215]:
result = sales_logs.loc[sales_logs.difference > pd.Timedelta(5, 'm')]
# в этом примере мы будем сравнивать разницу в 5 минутах между difference
# и созданной на лету timedelta куда передадим условия равное 5 минутам и измерению в минутах
# наш результат мы запишем в переменную result, а откроем фильтрацию по компоненту .loc

In [208]:
result

,SUBS_ID,PROD_ID,START_DTTM,END_DTTM,FILIAL_ID,ACT_DTTM,difference
0,id5416547,1743,2020-03-17 10:17:00,2020-03-25 11:00:00,3,17-03-2020 10:17,8 days 00:43:00
1,id2185490,3210,2020-03-16 16:28:00,2020-12-01 00:00:00,2,16-03-2020 16:28,259 days 07:32:00
2,id7642700,3020,2020-03-15 14:21:00,2020-03-15 23:42:00,6,15-03-2020 14:21,0 days 09:21:00
3,id7642700,3020,2020-03-15 14:21:00,2020-03-15 23:42:00,6,15-03-2020 14:21,0 days 09:21:00

In [209]:
result.SUBS_ID.sort_values().values

array(['id2185490', 'id5416547', 'id7642700', 'id7642700'], dtype=object)

In [210]:
result.to_csv('result.csv')